// models/faq_model.dart

class FAQ {
  String question;
  String? link;
  List<String> answers;

  FAQ({
    required this.question,
    this.link,
    required this.answers,
  });

  factory FAQ.fromJson(Map<String, dynamic> json) {
    return FAQ(
      question: json['question'] as String,
      link: json['link'] as String?,
      answers: List<String>.from(json['answers']),
    );
  }

  Map<String, dynamic> toJson() {
    return {
      'question': question,
      'link': link,
      'answers': answers,
    };
  }
}

class FAQList {
  List<FAQ> getBanks() => faqData.map((map) => FAQ.fromJson(map)).map((item) => item).toList();
}

// This is the static data converted from JavaScript to Dart
final List<Map<String, dynamic>> faqData = [
  {
    'question': 'Хэрхэн бүртгүүлэх вэ?',
    'link': 'https://www.facebook.com/Portal.mnofficial/videos/1277084783383600',
    'answers': [
      'Та Portal.mn сайтад бүртгүүлэхдээ <strong>Нэвтрэх</strong> хэсгийн доод талд байрлах <strong>Бүртгэлгүй бол ЭНД ДАРНА УУ</strong> товчийг дарж өөрийн и-мэйл хаягаар бүртгэл үүсгэх бөгөөд таны и-мэйл хаягт очих 6 оронтой тоог оруулснаар таны бүртгэл баталгаажна.',
      ' "Facebook" дээр дарж шинээр бүртгүүлэх боломжтой.  Ингэснээр таны "Facebook"-тэй холбоотой имэйл хаягаар автоматаар бүртгэл үүсэх юм.',
    ],
  },
  {
    'question': 'Хэрхэн нэвтрэх вэ?',
    'link': 'https://www.facebook.com/share/v/19rdr5NPEJ/',
    'answers': [
      'Portal.mn-руу бүртгэлтэй <strong>"Хэрэглэгчийн и-мэйл"</strong> болон нууц үгээ оруулан нэвтрэхээс гадна <strong>"Facebook"</strong> хаягаар нэвтрэх боломжтой. <br/>' +
          'Хэрхэн фэйсбүүкээр нэвтрэх болон фэйсбүүк холбох заавар видеотой доорх холбоосоор орж танилцана уу. ',
    ],
  },
  {
    'question': 'Нууц үгээ мартсан бол яах вэ?',
    'answers': [
      'Та Нэвтрэх хэсэгт байрлах <strong>Нууц үг мартсан?</strong> товчин дээр дарж <strong>бүртгэлтэй и-мэйл</strong>-ээ оруулснаар Нууц үг сэргээх гэсэн хэсэг рүү шилжинэ. Та шинэ нууц үг үүсгээд <strong>и-мэйл хаяг</strong> руу илгээгдсэн 6 оронтой баталгаажуулах кодыг оруулснаар таны нууц үг амжилттай солигдоно. ',
    ],
  },
  {
    'question': 'Худалдан авсан тасалбараа хаанаас харах вэ? И-Мэйл хаягаар ирэх үү?',
    'answers': [
      'Portal.mn рүү бүртгэлтэй хаягаараа нэвтрэхэд баруун дээд буланд таны хэрэглэгчийн нэр/username харагдана. Хэрэглэгчийн нэр/username дээр дарах үед "Хэрэглэгчийн булан"-руу үсрэх бөгөөд энэ цэсэд байрлах Миний тасалбар хэсгээс өөрийн худалдан авсан тасалбараа харна. Таны худалдан авсан тасалбар и-мэйл хаягаар очихгүй. ',
    ],
  },
  {
    'question': 'Portal.mn сайтаас авсан тасалбараа биет тасалбар болгон авах боломжтой юу? ',
    'answers': [
      'Portal.mn сайтаас авсан тасалбар Миний тасалбар хэсэгт QR хэлбэрээр харагдах бөгөөд биет тасалбар болгох боломжгүй.',
    ],
  },
  {
    'question': ' Худалдан авсан тасалбарынхаа суудал, хаалганы дугаарыг хаанаас харах вэ ?',
    'answers': [
      'Таны худалдан авсан тасалбар  <strong>"Хэрэглэгчийн булан"->"Миний тасалбар"</strong> хэсэгт орох ба тасалбарын зүүн доод буланд байрлах <strong>QR код товчлуур</strong> дээр дарвал нэвтрэх QR код гарч ирнэ. Тухайн QR кодын доод талд таны суудал, эгнээ, секторын мэдээлэл байна.  ',
    ],
  },
  {
    'question': 'Тасалбар буцаах болон өдөр солих боломжтой юу? ',
    'link': 'https://www.facebook.com/share/v/15vkNCKgTy/',
    'answers': [
      'Хэрэглэгч өөрийн хүсэлтээр тасалбар буцаах болон өдөр солих боломжгүй ба тоглолт үзэх боломжгүй болсон тохиолдолд өөрийн тасалбараа бусад хэрэгдэгчдэд зарахаар хоёрдогч зах зээл дээр LIST хийх боломжтой.\n' +
          'Дараах тохиолдолд тасалбар буцаалт хийгдэнэ. Үүнд:<br/>' +
          '      - Тоглолт цуцлагдсан<br/>' +
          '      - Тоглолт хойшлогдсон',
    ],
  },
  {
    'question': '"Apple Wallet"- руу тасалбар хэрхэн нэмэх вэ?',
    'answers': [
      'IPhone хэрэглэгч та Portal.mn апп-аасаа тасалбараа Apple wallet руугаа шилжүүлэхдээ дараах алхмуудыг дуустал нь хийхийг сайтар анхаарна уу. <br/>' +
          '1. Portal.mn апп дээрх тасалбар дээрээ даран "Add to apple wallet" товчийг дарна. <br/>' +
          '2. Таны тасалбарыг Apple wallet руу шилжүүлэх явцыг хүлээнэ. <br/>' +
          '3. Apple wallet дээр нэмэн цонх гарч ирэх үед ADD товчийг заавал дарна.  /Жич: Хэрвээ та "ADD" товч даралгүйгээр гарсан тохиолдолд таны тасалбар Apple wallet болон portal.mn аль алинд нь харагдахгүй болохыг анхааруулж байна/',
    ],
  },
  {
    'question': 'Тасалбар амжилттай худалдан авсан боловч "Миний тасалбар" хэсэгт ороогүй байна. Хэрхэн тасалбараа харах вэ? ',
    'answers': [
      'Төлбөр хийгдэж тасалбар амжилттай худалдан авсан боловч Миний тасалбар" хэсэгт ороогүй бол Фэйсбүүк дээр байх манай Portal.mn хуудас руу холбогдоорой.',
    ],
  },
  {
    'question': 'NFT-ээр хэрхэн тасалбар хөнгөлөлттэй үнээр худалдан авах вэ? ',
    'link': 'https://www.facebook.com/share/v/16QZoogFyo/',
    'answers': [
      'Хэрэв та The Wolves NFT эзэмшдэг бол <strong>СОНГОГДСОН</strong> тоглолтуудын тасалбарыг хямдралтай авах боломжтой. Та NFT-ээр хөнгөлөлт эдлэх эрхтэй эвент рүү орвол <strong>Худалдан авах</strong> хэсгийн дээд талд <strong>NFT-ээр тасалбар авах</strong> товч байрлана. Дарж орсноор <strong>Таны ашиглах боломжтой NFT-нүүд</strong> харагдах ба та NFT- ээ сонгоод тасалбараа худалдан авна.  Жишээ зааврыг доорх холбоосоор орж танилцана уу. ',
    ],
  },
  {
    'question': 'Хоёрдогч зах зээл гэж юу вэ?',
    'link': 'https://www.facebook.com/share/v/1BwSx5tJuH/',
    'answers': [
      'Та "Хоёрдогч зах зээл" дээр Portal.mn- ээс худалдан авсан тасалбараа борлуулж болохоос гадна, бусад хэрэглэгчдийн зарахаар LIST хийсэн тасалбаруудаас худалдан авалт хийх боломжтой. Хоёрдогч зах зээл дээр хэрхэн тасалбараа LIST хийх заавар видеог хүргэж байна.',
    ],
  },
  {
    'question': 'Хоёрдогч зах зээлээс тасалбар худалдан авбал аюулгүй байж чадах уу? ',
    'answers': ['Мэдээж тийм. Хоёрдогч зах зээлээс тасалбар авах үед өмнөх хэрэглэгч дээрх QR хүчингүй болж танд шинэ QR үүснэ. '],
  },
  {
    'question': 'MERCH/МЕРЧ хэрхэн худалдан авах вэ? ',
    'answers': [
      'Тухайн MERCH-ийг гаргаж буй эвент рүү ороход <strong>Мерчандайз цэс</strong> байх ба тухайн тоглолттой холбоотой бүх MERCH- үүд харагдана. Та өөрийн худалдан авах гэж буй MERCH- рүү ороод размер, өнгө, тоо ширхгээ сонгон төлбөрөө төлснөөр амжилттай худалдан авалт хийгдэнэ. Таны худалдан авсан бүтээгдэхүүн Хэрэглэгчийн буланд байрлах <strong>Миний Мерч</strong> хэсэгт харагдана. /Хаанаас MERCH-ээ авах мэдээллийг тухайн тоглолтын Дэлгэрэнгүй хэсгээс орж авна уу/',
    ],
  },
  {
    'link': 'https://www.facebook.com/reel/974938030977965',
    'question': 'BAR хэсгээс хэрхэн уух зүйлсээ оочир дараалалгүй авах вэ?',
    'answers': [
      'Тухайн эвент рүү орвол <strong>BAR</strong> цэс харагдах ба та хүссэн уух зүйлсээ сонгоод урьдчилсан худалдан авалт хийх боломжтой. Таны худалдан авалт хийсэн бүтээгдэхүүн Хэрэглэгчийн буланд байрлах BAR хэсэгт харагдана. Эвентийн үеэр ажиллаж байгаа уух зүйл борлуулах цэг дээр очиж захиалгынхаа QR-аа уншуулаад шууд авах боломжтой. Жишээ зааварыг доорх холбоосоор орж танилцана уу. ',
    ],
  },
  {
    'link': 'https://www.facebook.com/share/v/1DV3pP8yWb/',
    'question': 'Portal.mn дээр хэрхэн Данс холбох вэ?',
    'answers': ['Portal.mn- ийн <strong>"My wallet"</strong> хэсэгт хэрхэн данс холбож, мөнгөө татаж авах зааврыг хүргэж байна.'],
  },
];
